do 

function run(msg, matches) 
return [[
️★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
⚠️〰〰〰〰〰〰〰〰〰〰⚠️
💹»» #اوامر_حمايـة_المجموعـة💯💯
💠➖➖💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح الڤيديو ✅
🌐»» #d vi
🌐»» #b vi
💠➖➖💠➖➖💠➖➖�
🔰»»قفل وفتـح الرد  ✅
🌐»» #d re
🌐»» #b re
💠➖➖💠➖➖💠➖➖💠�
🔰»» قفل وفتـح دردشـة المجموعـة ✅
🌐»» #d tx
🌐»» #b tx
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفـتح الصوتيات❎
🌐»» #d au
🌐»» #b au
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح اضافـة الأعضاء✅
🌐»» #d mm
🌐»» #b mm
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح اعادة التوجيـه ❎
🌐»» #d fw
🌐»» #b fw
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح ارسال الملفات ❇️
🌐»» #d mf
🌐»» #b mf
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح الصور المتحركـة ❇️
🌐»» #d gf
🌐»» #b gf
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتح الملصـقات ❎ 
🌐»» #d st
🌐»» #b st
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل و فتح الصور ️💹
🌐»» #d ph
🌐»» #b ph
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتح الروابط💹
🌐»» #d lk
🌐»» #b lk
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح التكرار وتحديد التكرار♍️
🌐»» #d ff
🌐»» #b ff
🌐»» #sff (عدد)
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح الرسائل الطويلـة♒️
🌐»» #d ss
🌐»» #b ss
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح اللغـة العربيـة💟
🌐»» #d aa
🌐»» #b aa
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفَتـح الكُل 
🌐»»#d al
🌐»»#b al
 ➖▪️➖▫️➖🔸➖🔹➖🔺➖🔻
معـرف گر9ب الـدعم ✔️™ : 👇

                           @DEVBOT_1

〰➰〰➰〰➰〰➰〰➰〰➰
#Dev :
@ali_iraqi  ❌
@sudad1996  ❌
@h_iQ_d  ❌
@alisama20 ❌
@HISHAM_AL_MOKHLES  ❌
◽️◾️◽️◾️◽️◾️◽️◾️◽️◾️◽️◾️
️]] 
end 

return { 
description = "Shows bot q", 
usage = "help Shows bot q", 
patterns = { 
"help4$" 
}, 
run = run 
} 
end