do 

function run(msg, matches) 
return [[ 
★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
★★★★★★★★★★★★★★★
✅>> رفع مشرف 
Ⓜ️>> #ow {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❇️>> اضهار المشرف 
Ⓜ️>> #xow 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
✅>> رفع ادمن
Ⓜ️>> #pp {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❎>> ازاله ادمن 
Ⓜ️>> #qq {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❇️>> اضهار الادمنيه 
Ⓜ️>> #xpp
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
🈯️>> وضع معرف للمجموعة 
Ⓜ️>> #suser + معرف 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
❌❌ رابط كروب الدعم 🍃🍃👇

                              @DEVBOT_A

⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
#DEVBOT 
@ali_iraqi ❌
@Alisama20 ❌
@h_iQ_d ❌
@sudad1996 ❌
@HISHAM_AL_MOKHLES ❌
]] 
end 

return { 
description = "Shows bot q", 
usage = "help Shows bot q", 
patterns = { 
"help2$" 
}, 
run = run 
} 
end