do 

function run(msg, matches) 
return [[ 
★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار القوانين 
🌐>> #ro
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع قوانين 
🌐>> #sro
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع صورة للمجموعة 
🌐>> #sph
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع اسم للمجموعة 
🌐>> #snm
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> حذف رسائل بالعدد
🌐>> #del (عدد) 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اضهار ايديات الأعضاء 
🌐>> #who
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار ايدي عضو 
🌐>> #id {user} Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> صنع رابط جديد 
🌐>> #nwlk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اضافه رابط 
🌐>> #slk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الرابط 
🌐>> #lk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> أرسال الرابط الى الخاص 
🌐>> #linkpv
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الطقس 
🌐>> #wea + المدينة 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار موقعك في المجموعة 
🌐>> #me 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> عمل تاگ للأعضاء
🌐>>/tagall + الرساله
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الوقت 
🌐>> #time + مدينة
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اوامر خاص 
🌐>> #help pv
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> عرض اوقات الصلاه
🌐>> #azan (المدينه)
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
❌❌ رابط كروب الدعم 🍃🍃👇

                         @DEVBOT_A

⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
#DEVBOT 
@ali_iraqi ❌
@Alisama20 ❌
@h_iQ_d ❌
@sudad1996 ❌
@HISHAM_AL_MOKHLES ❌
]] 
end 

return { 
description = "Shows bot q", 
usage = "help Shows bot q", 
patterns = { 
"help3$" 
}, 
run = run 
} 
end