do 

function run(msg, matches) 
return [[ 
★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
⚠️〰〰〰〰〰〰〰〰〰〰〰⚠️
💹»» #اوامر_الطرد_الحضر

🌐»» #de {user} [id] Reply

🔰»»طرد عضو من المجموعة ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠 
🌐»» #bn {user} [id] Reply

🔰»» حضر عضو من المجموعة ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #ubn {user} [id] Reply

🔰»» الغاء الحضر عن العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #bnal {user} [id] Reply

🔰»» عضر عضو عام ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #ubnal {user} [id] Reply
 
🔰»» الغاء حضر العام عن العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sbn {user} [id] Reply

🔰»» قائمة المحضورين ❇️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sil {user} [id] Reply

🔰»»كتم عضو ❇️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sil {user} [id] Reply

🔰»» الغاء كتم العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #silnt

🔰»» قائمة المكتومين 🈯️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #kkme

🔰»» للخروج من المجموعة 💹
💠➖➖💠➖➖💠➖➖💠➖➖💠
❌❌ معرف كروب الدعم 🍃🍃👇

                 @DEVBOT_A

⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
#DEVBOT 
@ali_iraqi ❌
@Alisama20 ❌
@h_iQ_d ❌
@sudad1996 ❌
@HISHAM_AL_MOKHLES ❌
]] 
end 

return { 
description = "Shows bot q", 
usage = "help Shows bot q", 
patterns = { 
"help1$" 
}, 
run = run 
} 
end