do 

function run(msg, matches) 
return [[ اهلا بك
شكراً لك لأختياركَ ❤️
@DEVIL2BOT 
عزيزي يجب عليـك أن تعلم أولاً أن ديـڤل يدعم جميع الأوامر   
 بشرط أن تستدخم الأمر بشكل صحيح 🔰
أليكَ تفصيل مختصر عن طريقـة الأستخدام" 
🎋أوامر الطرد والحظر
يجب أن يسبق الأمر ← # → هذا الرمز 
كما نعرفـه بأسم ( شباك ) 
تضع أولاً الرمز # وبعدها تكتب الأمر و تضع فراغـاً واحداً 🔰 ثم تضع معـرف أو آيدي العضو الذي تريد طرده او حظره أو وضعـه تحت الكتم أو العكس عن ذلك✋🏾🌐 وكذلك يمكنك أستخدام الأوامـر عن طريق الرد على رسالـة العضو الذي تريد طرده ♨️
🎋أوامر المشرفين والأداريين 
أيضـاً يجب وضع علامـة ←#→ قبل الأمر من ثم تكتب الأمر وتضع مسافـة واحدة 1⃣ ثم تضع مُعرف أو آيدي العضو الذي تريد اضـافتـه أو حذفـه من قائمـة الأداريين أو يمكنك فعل ذلك عن طريق الرد على رسالـتـه ✅  هذا بالنسـبـة للأضافـة او الحذف  أما الأوامر الأخرى فـ تساعدك على معرفـة الأداريين وتستخدم بدون أضافـة معرف بعدها 📳
🎋أوامر أعدادات المجموعـة ✋🏾
إن بعض هذه الأوامر لها شروط يجب أن تتوفر 
على سبيل المثـال لا يمكنك وضع معـرف للمجموعـة ٱن لَم تكُن المجموعـة( عامـة ) 
أما بقيـة الأوامر فتستخدم كـ الأوامر التي سبق ذكرها ☝🏼️ تضع ←#→ ثم تكتب الأمر✋🏾ثم تضع مسافـة واحدة ثم تضع ماتريد كتابتـه 🍃 كـ قوانين المجموعـة أو وصف المجموعـة أو تغيير الأسـم 🍸 أما بقيـة الأوامر فـ تستخدم بمفردهـا 🌐 كـ أظهـار , القوانين , الوصف , وغيرها كما موجود في help  
🎋أوامر حمايـة المجموعـة 🛡⚔
أوامـر جداً سهلـة ومُبَسـطـة 💡 يوفل لَكَ ديڤل أوامر قفل وفتح سلسـة ✋🏾🍃
#b للفـتح
#d للقُـفِل 
وأيضـاً كلمات مختصرة مثل : 
spam → ss 
link → lk 
photo → ph 
audio → au 
vedio → vi 
وغيرهـا من الأوامـر الموجودة يمكنك رؤيتـها عند طلب أوامر الحمايـة 💪🏽🍂
كُلُ هـذا وأكثر ستجدهُ في : 
@DEVIL2BOT  🍁
لـطلب أي مساعدة يمكنك الدخول الى مجموعـة دعم الپوت والطلب 🌹🌿 
مُعرف المـجموعـة : 
@DEVBOT_A 
➖☑️➖🔘➖®➖©➖✔️➖➰➖🎶 
#Dev - bot 

@ali_iraqi ❌
@sudad1996 ❌
@h_iQ_d ❌
@Alisama20❌
@HISHAM_AL_MOKHLES ❌ 
]] 
end 

return {
description = "Shows bot q", 
usage = "help Shows bot q", 
patterns = { 
    "كيف استخدم$"
}, 
run = run
} 
end