--@MAXDEVD

do
local function run(msg,matches)

if is_momod(msg) and matches[1]== 'help' and matches[2]== 'pv' or matches[1]== '@MAXDEVD' then
local info = [[
★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
⚠️〰〰〰〰〰〰〰〰〰〰〰⚠️
💹»» #اوامر_الطرد_الحضر
🌐»» #de {user} [id] Reply
🔰»»طرد عضو من المجموعة ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠 
🌐»» #bn {user} [id] Reply
🔰»» حضر عضو من المجموعة ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #ubn {user} [id] Reply
🔰»» الغاء الحضر عن العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #bnal {user} [id] Reply
🔰»» عضر عضو عام ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #ubnal {user} [id] Reply
🔰»» الغاء حضر العام عن العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sbn {user} [id] Reply
🔰»» قائمة المحضورين ❇️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sil {user} [id] Reply
🔰»»كتم عضو ❇️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sil {user} [id] Reply
🔰»» الغاء كتم العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #silnt
🔰»» قائمة المكتومين 🈯️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #kkme
🔰»» للخروج من المجموعة 💹
💠➖➖💠➖➖💠➖➖💠➖➖💠
✅>> رفع مشرف 
Ⓜ️>> #ow {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❇️>> اضهار المشرف 
Ⓜ️>> #xow 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
✅>> رفع ادمن
Ⓜ️>> #pp {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❎>> ازاله ادمن 
Ⓜ️>> #qq {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❇️>> اضهار الادمنيه 
Ⓜ️>> #xpp
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
🈯️>> وضع معرف للمجموعة 
Ⓜ️>> #suser + معرف 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار القوانين 
🌐>> #ro
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع قوانين 
🌐>> #sro
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع صورة للمجموعة 
🌐>> #sph
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع اسم للمجموعة 
🌐>> #snm
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> حذف رسائل بالعدد
🌐>> #del (عدد) 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اضهار ايديات الأعضاء 
🌐>> #who
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار ايدي عضو 
🌐>> #id {user} Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> صنع رابط جديد 
🌐>> #nwlk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اضافه رابط 
🌐>> #slk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الرابط 
🌐>> #lk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> أرسال الرابط الى الخاص 
🌐>> #linkpv
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الطقس 
🌐>> #wea + المدينة 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار موقعك في المجموعة 
🌐>> #me 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> عمل تاگ للأعضاء
🌐>>/tagall + الرساله
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الوقت 
🌐>> #time + مدينة
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اوامر خاص 
🌐>> #help pv
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
⚠️〰〰〰〰〰〰〰〰〰〰⚠️
💹»» #اوامر_حمايـة_المجموعـة💯💯
💠➖➖💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح الڤيديو ✅
🌐»» #d vi
🌐»» #b vi
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح دردشـة المجموعـة ✅
🌐»» #d tx
🌐»» #b tx
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفـتح الصوتيات❎
🌐»» #d au
🌐»» #b au
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح اضافـة الأعضاء✅
🌐»» #d mm
🌐»» #b mm
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح اعادة التوجيـه ❎
🌐»» #d fwd
🌐»» #b fwd
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح ارسال الملفات ❇️
🌐»» #d mf
🌐»» #b mf
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح الصور المتحركـة ❇️
🌐»» #d gf
🌐»» #b gf
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتح الملصـقات ❎
🌐»» #d st
🌐»» #b st
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل و فتح الصور ️💹
🌐»» #d ph
🌐»» #b ph
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتح الروابط💹
🌐»» #d lk
🌐»» #b lk
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح التكرار وتحديد التكرار♍️
🌐»» #d ff
🌐»» #b ff
🌐»» #sff (عدد)
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح الرسائل الطويلـة♒️
🌐»» #d ss
🌐»» #b ss
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح اللغـة العربيـة💟
🌐»» #d aa
🌐»» #b aa
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفَتـح الكُل 
🌐»»#d al
🌐»»#b al
 ➖▪️➖▫️➖🔸➖🔹➖🔺➖🔻
رابـط گر9ب الـدعم ✔️™ : 
https://telegram.me/joinchat/C6Txxz7Nn4vOUkIAk4oMFg

〰➰〰➰〰➰〰➰〰➰〰➰
🃏الـمطـورين™ : 
@ali_iraqi 
@sudad1996 
@h_iQ_d 
@alisama20
@HISHAM_AL_MOKHLES 
◽️◾️◽️◾️◽️◾️◽️◾️◽️◾️◽️◾️
]]

send_large_msg("user#id"..msg.from.id, info)
end

if is_momod(msg) and matches[1]== 'help' and matches[2]== 'pv' or matches[1]== '@MAXDEVD' then
return "تم ارسال الاوامر الى  @"..msg.from.username.."\n".."ان لم يتم وصول الرسائل ارسل رسالة الى الخاص لكي يتم فك الحظر" 
end
local reply_id = msg['id']
if not is_momod(msg) then
local  info = 'للبشرفين فقط‼️'
reply_msg(reply_id, info, ok_cb, false)
end 

end
return {
patterns ={
  "^[#](help) (pv)$",
  
},
run = run
}
end